app/controllers/results_controller.rb

  def index
    @date = params[:date] ? Date.parse( params[:date] ) : Date.today
    if params[:refresh]
      Activity.update_activity!( @fitbit, @user, @date )
---
UPDATE "users" SET "access_token" = 'c630fd2ec5fbabe446bdb1fb7638aa25', "access_secret" = 'b935f86eb5d0bf996c48894c026ab8c7', "display_name" = 'Pawel', "last_access" = '2015-01-02 01:13:20.904497', "updated_at" = '2015-01-02 01:13:20.905826' WHERE "users"."id" = 1